trunk/app/controllers/pois_controller.rb

  def index
    #usamos la gema geocoder para buscar todos los puntos dentro de un determinado radio de la ubicacion del usuario
    respond_to do |format|
      if params[:latitude] && params[:longitude]
        pois = Poi.near([params[:latitude], params[:longitude]], 1, :units => :km).
          includes(:category, :events).all    # puntos a 1 km(se convierte a millas)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (1)
SELECT pois.*, (111.19492664455873 * ABS(pois.latitude - -34.6378996) * 0.7071067811865475) + (96.29763124613503 * ABS(pois.longitude - -58.5026959) * 0.7071067811865475) AS distance, CASE WHEN (pois.latitude >= -34.6378996 AND pois.longitude >= -58.5026959) THEN 45.0 WHEN (pois.latitude < -34.6378996 AND pois.longitude >= -58.5026959) THEN 135.0 WHEN (pois.latitude < -34.6378996 AND pois.longitude < -58.5026959) THEN 225.0 WHEN (pois.latitude >= -34.6378996 AND pois.longitude < -58.5026959) THEN 315.0 END AS bearing FROM "pois" WHERE (pois.latitude BETWEEN -34.646892816059186 AND -34.62890638394081 AND pois.longitude BETWEEN -58.513626438396365 AND -58.49176536160363) ORDER BY distance ASC

  def create
    poi = Poi.new(params[:poi])

    respond_to do |format|
      if poi.valid?
        poi.save
---
INSERT INTO "pois" ("address", "category_id", "created_at", "description", "latitude", "longitude", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      poi = Poi.find(params[:poi][:id])
      if poi.update_attributes(params[:poi])
---
SELECT "pois".* FROM "pois" WHERE "pois"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "pois" SET "description" = 'Some description', "updated_at" = '2014-08-19 01:30:27.380506' WHERE "pois"."id" = 1

  def destroy
    poi = Poi.find(params[:id])

    respond_to do |format|
      if poi.destroy
---
SELECT "pois".* FROM "pois" WHERE "pois"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "pois" WHERE "pois"."id" = ?  [["id", 1]]