trunk/app/controllers/users_controller.rb

	def get_or_create
	    user = User.where(:facebook_id => params[:facebook_id]).first
	    if user.blank?
	    	user = User.new(:facebook_id => params[:facebook_id], :name => params[:name],  :surname => params[:surname])
	  	end

	    respond_to do |format|
	      if user.valid?
	        user.save
---
SELECT "users".* FROM "users" WHERE "users"."facebook_id" = '10204856202551723' LIMIT 1
INSERT INTO "users" ("created_at", "email", "facebook_id", "name", "surname", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 25 Aug 2014 00:57:42 UTC +00:00], ["email", nil], ["facebook_id", "10204856202551723"], ["name", nil], ["surname", nil], ["updated_at", Mon, 25 Aug 2014 00:57:42 UTC +00:00]]