app/controllers/categories_controller.rb

  def index
    #devuelve todas las categorias ordenadas alfabeticamente
    respond_to do |format|
        categories = Category.order("name ASC").all
---
SELECT "categories".* FROM "categories" ORDER BY name ASC